import React from 'react'
import { motion, useInView } from 'framer-motion';
import { useRef, useEffect, useState } from 'react';

export const MotionText1 = () => {

    const textRef = useRef<HTMLDivElement>(null);
    const [isVisible, setIsVisible] = useState(false);

    const checkVisibility = () => {
        if (textRef.current) {
            const rect = textRef.current.getBoundingClientRect();
            // Проверяем, находится ли текст в пределах видимости (20 пикселей до текста)
            setIsVisible(rect.top < window.innerHeight - 20);
        }
    };

    useEffect(() => {
        window.addEventListener('scroll', checkVisibility);
        checkVisibility(); // Проверяем видимость при первом рендере

        return () => {
            window.removeEventListener('scroll', checkVisibility);
        };
    }, []);

    return (
        <motion.section
            ref={textRef}
            initial={{ opacity: 0, y: -100 }} // Начальное состояние (невидимый и смещен вверх)
            animate={{ opacity: isVisible ? 1 : 0, y: isVisible ? 0 : -100 }} // Конечное состояние
            transition={{ duration: 1 }} // Длительность анимации
            className='flex flex-col sm:flex-row sm: justify-between mt-10'
        >
            <h2 className='text-[24px] sm:text-[32px] min-w-[255px] items-start'>
                <svg className='w-11 h-12 items-start' viewBox="0 0 42 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M35.9062 21H35.25V15.75C35.25 14.5312 34.2188 13.5 33 13.5C31.6875 13.5 30.75 14.5312 30.75 15.75V21H23.25V15.75C23.25 14.5312 22.2188 13.5 21 13.5C19.6875 13.5 18.75 14.5312 18.75 15.75V21H11.25V15.75C11.25 14.5312 10.2188 13.5 9 13.5C7.6875 13.5 6.75 14.5312 6.75 15.75V21H6C2.625 21 0 23.625 0 26.9062V44.9062C0 46.6875 1.3125 48 3 48H39C40.5938 48 42 46.6875 42 45V27C42 23.7188 39.2812 21 35.9062 21ZM37.5 43.5H4.5V36.8438C6.1875 36.5625 7.6875 35.9062 9 35.0625C10.5938 36.0938 12.6562 37.0312 15 37.0312C17.25 37.0312 19.3125 36.0938 21 35.0625C22.5938 36.0938 24.6562 37.0312 27 37.0312C29.25 37.0312 31.3125 36.0938 33 35.0625C34.2188 35.9062 35.7188 36.6562 37.5 36.9375V43.5ZM37.5 32.25C36.1875 31.875 35.0625 31.0312 34.3125 30.5625C33.5625 29.9062 32.3438 29.9062 31.5938 30.5625C30.5625 31.3125 28.7812 32.5312 27 32.5312C25.125 32.5312 23.3438 31.3125 22.3125 30.5625C21.5625 29.9062 20.3438 29.9062 19.5938 30.5625C18.5625 31.3125 16.7812 32.5312 15 32.5312C13.125 32.5312 11.3438 31.3125 10.3125 30.5625C9.5625 29.9062 8.34375 29.9062 7.59375 30.5625C6.84375 31.0312 5.71875 31.875 4.5 32.25V27C4.5 26.25 5.15625 25.5 6 25.5H36C36.75 25.5 37.5 26.25 37.5 27V32.25ZM33 10.5C35.0625 10.5 36.75 8.8125 36.75 6.75C36.75 4.6875 33 0 33 0C33 0 29.25 4.6875 29.25 6.75C29.25 8.90625 30.8438 10.5 33 10.5ZM21 10.5C23.0625 10.5 24.75 8.8125 24.75 6.75C24.75 4.6875 21 0 21 0C21 0 17.25 4.6875 17.25 6.75C17.25 8.90625 18.8438 10.5 21 10.5ZM9 10.5C11.0625 10.5 12.75 8.8125 12.75 6.75C12.75 4.6875 9 0 9 0C9 0 5.25 4.6875 5.25 6.75C5.25 8.90625 6.84375 10.5 9 10.5Z" fill="#4C2000"></path>
                </svg>
                О наших <br />тортах
            </h2>
            <p className='text-[20px] sm:text-[24px] items-start'>Верность традициям, соблюдение рецептур и технологий. Наши торты - шедевры, которые рождаются благодаря более чем 10-ти летнему опыту в изготовлении кондитерских изделий. Мы предоставляем широчайшую галерею тортов, ведь каждый заказ - уникален: Вы выбираете начинку и дизайн торта на Ваш собственный вкус. Гарантируем Вам 100% гарантию натуральности и свежести наших продуктов, ручную работу и изготовление в забронированный день, ведь нам доверяют более 2500 тысяч клиентов, чей праздник удался на славу ~</p>
        </motion.section>
    )
}

export const MotionText2 = () => {

    const textRef = useRef<HTMLDivElement>(null);
    const [isVisible, setIsVisible] = useState(false);

    const checkVisibility = () => {
        if (textRef.current) {
            const rect = textRef.current.getBoundingClientRect();
            // Проверяем, находится ли текст в пределах видимости (20 пикселей до текста)
            setIsVisible(rect.top < window.innerHeight - 10);
        }
    };

    useEffect(() => {
        window.addEventListener('scroll', checkVisibility);
        checkVisibility(); // Проверяем видимость при первом рендере

        return () => {
            window.removeEventListener('scroll', checkVisibility);
        };
    }, []);

    return (
        <motion.section
            ref={textRef}
            initial={{ opacity: 0, y: -50 }} // Начальное состояние (невидимый и смещен вверх)
            animate={{ opacity: isVisible ? 1 : 0, y: isVisible ? 0 : -50 }} // Конечное состояние
            transition={{ duration: 1 }} // Длительность анимации
            className='flex flex-col sm:flex-row justify-between items-start mt-16 sm:mt-10'
        >
            <h2 className='text-[24px] sm:text-[32px] min-w-[255px] relative'>
                <svg className='w-[43px] h-[48px] items-start' viewBox="0 0 43 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M41.4062 16.6875C42.4375 18.1875 43 19.9688 42.9062 21.75C42.9062 23.5312 42.3438 25.2188 41.2188 26.7188C40.0938 28.125 38.5938 29.1562 36.9062 29.625L34.375 45.5625C34.2812 46.2188 33.9062 46.875 33.3438 47.3438C32.7812 47.8125 32.125 48 31.375 48H29.125L31.375 30H28.2812L26.0312 48H17.875L15.625 30H12.5312L14.7812 48H12.5312C11.7812 48 11.125 47.8125 10.5625 47.3438C10 46.875 9.625 46.2188 9.53125 45.5625L7 29.625C5.3125 29.1562 3.8125 28.125 2.6875 26.7188C1.5625 25.2188 1 23.5312 1 21.75C0.90625 19.9688 1.46875 18.1875 2.5 16.6875C3.4375 15.2812 4.9375 14.1562 6.625 13.5938L8.5 12.5625C8.78125 10.7812 9.625 9.09375 11.0312 7.875C12.3438 6.75 14.125 6 16 6H19.4688C19.8438 6.09375 20.2188 5.90625 20.5938 5.71875C20.9688 5.53125 21.1562 5.15625 21.3438 4.78125C21.5312 4.40625 21.5312 4.03125 21.4375 3.65625C21.3438 3.28125 21.1562 2.90625 20.875 2.625C20.6875 2.4375 20.5 2.15625 20.5 1.875C20.4062 1.59375 20.4062 1.21875 20.5938 0.9375C20.6875 0.65625 20.875 0.46875 21.1562 0.28125C21.3438 0.09375 21.625 0 21.9062 0C25.375 0.09375 28.6562 1.3125 31.1875 3.65625C33.625 6 35.2188 9.1875 35.4062 12.6562L37.2812 13.5938C38.9688 14.1562 40.4688 15.2812 41.4062 16.6875ZM37.0938 24.5625C37.75 24 38.2188 23.1562 38.4062 22.2188C38.5938 21.2812 38.4062 20.3438 37.8438 19.5C37.375 18.6562 36.625 18.0938 35.7812 17.8125C35.5938 17.7188 35.4062 17.7188 35.3125 17.625L32.5938 16.2188C32.125 15.9375 31.6562 15.5625 31.375 15.0938C31.0938 14.625 30.9062 14.0625 31 13.5C30.9062 11.8125 30.4375 10.2188 29.5938 8.71875C28.6562 7.3125 27.3438 6.1875 25.8438 5.4375C25.75 5.8125 25.6562 6.1875 25.4688 6.5625C25 7.6875 24.1562 8.71875 23.125 9.46875C22 10.125 20.7812 10.5 19.4688 10.5H16C15.1562 10.5 14.4062 10.875 13.8438 11.4375C13.2812 12 13 12.75 13 13.5C13 14.0625 12.8125 14.625 12.5312 15.0938C12.25 15.5625 11.7812 15.9375 11.3125 16.2188L8.59375 17.625C8.5 17.7188 8.3125 17.7188 8.125 17.8125C7.28125 18.0938 6.53125 18.6562 6.0625 19.5C5.5 20.3438 5.3125 21.2812 5.5 22.2188C5.6875 23.1562 6.15625 24 6.8125 24.5625C7.5625 25.2188 8.5 25.5 9.4375 25.5H34.4688C35.4062 25.5 36.3438 25.2188 37.0938 24.5625Z" fill="#4C2000"></path>
                </svg>
                <svg className='absolute w-[25px] h-[25px] f-[20px] -top-9 right-52' viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.5 0.00012207C13.0246 0.00012207 13.4989 0.301461 13.7165 0.775792L17.0368 7.96329L24.2243 11.2836C24.6987 11.5012 25 11.9756 25 12.5001C25 13.0247 24.6987 13.499 24.2243 13.7166L17.0368 17.037L13.7165 24.2245C13.4989 24.6988 13.0246 25.0001 12.5 25.0001C11.9754 25.0001 11.5011 24.6988 11.2835 24.2245L7.96317 17.037L0.77567 13.7166C0.301339 13.499 0 13.0247 0 12.5001C0 11.9756 0.301339 11.5012 0.77567 11.2836L7.96317 7.96329L11.2835 0.775792C11.5011 0.301461 11.9754 0.00012207 12.5 0.00012207ZM12.5 4.53137L10.1897 9.53137C10.0558 9.82155 9.82701 10.0503 9.53683 10.1843L4.53125 12.5001L9.53125 14.8104C9.82143 14.9443 10.0502 15.1731 10.1842 15.4633L12.5 20.4689L14.8103 15.4689C14.9442 15.1787 15.173 14.9499 15.4632 14.816L20.4688 12.5001L15.4688 10.1899C15.1786 10.0559 14.9498 9.82713 14.8158 9.53695L12.5 4.53137Z" fill="#A3A3A3"></path>
                </svg>
                <svg className='absolute w-[25px] h-[25px] f-[20px] top-3 -left-8 ' viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.5 0.00012207C13.0246 0.00012207 13.4989 0.301461 13.7165 0.775792L17.0368 7.96329L24.2243 11.2836C24.6987 11.5012 25 11.9756 25 12.5001C25 13.0247 24.6987 13.499 24.2243 13.7166L17.0368 17.037L13.7165 24.2245C13.4989 24.6988 13.0246 25.0001 12.5 25.0001C11.9754 25.0001 11.5011 24.6988 11.2835 24.2245L7.96317 17.037L0.77567 13.7166C0.301339 13.499 0 13.0247 0 12.5001C0 11.9756 0.301339 11.5012 0.77567 11.2836L7.96317 7.96329L11.2835 0.775792C11.5011 0.301461 11.9754 0.00012207 12.5 0.00012207ZM12.5 4.53137L10.1897 9.53137C10.0558 9.82155 9.82701 10.0503 9.53683 10.1843L4.53125 12.5001L9.53125 14.8104C9.82143 14.9443 10.0502 15.1731 10.1842 15.4633L12.5 20.4689L14.8103 15.4689C14.9442 15.1787 15.173 14.9499 15.4632 14.816L20.4688 12.5001L15.4688 10.1899C15.1786 10.0559 14.9498 9.82713 14.8158 9.53695L12.5 4.53137Z" fill="#A3A3A3"></path>
                </svg>
                <svg className='absolute w-[25px] h-[25px] f-[20px] top-5 right-44' viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.5 0.00012207C13.0246 0.00012207 13.4989 0.301461 13.7165 0.775792L17.0368 7.96329L24.2243 11.2836C24.6987 11.5012 25 11.9756 25 12.5001C25 13.0247 24.6987 13.499 24.2243 13.7166L17.0368 17.037L13.7165 24.2245C13.4989 24.6988 13.0246 25.0001 12.5 25.0001C11.9754 25.0001 11.5011 24.6988 11.2835 24.2245L7.96317 17.037L0.77567 13.7166C0.301339 13.499 0 13.0247 0 12.5001C0 11.9756 0.301339 11.5012 0.77567 11.2836L7.96317 7.96329L11.2835 0.775792C11.5011 0.301461 11.9754 0.00012207 12.5 0.00012207ZM12.5 4.53137L10.1897 9.53137C10.0558 9.82155 9.82701 10.0503 9.53683 10.1843L4.53125 12.5001L9.53125 14.8104C9.82143 14.9443 10.0502 15.1731 10.1842 15.4633L12.5 20.4689L14.8103 15.4689C14.9442 15.1787 15.173 14.9499 15.4632 14.816L20.4688 12.5001L15.4688 10.1899C15.1786 10.0559 14.9498 9.82713 14.8158 9.53695L12.5 4.53137Z" fill="#A3A3A3"></path>
                </svg>
                <span className='text-white border-solid border-2 bg-stone-700 border-stone-700 rounded-xl items-center absolute bottom-full right-20 text-[20px] p-[8px]' style={{ transform: 'rotate(-15deg)' }}>Новинка</span>
                ВАУ-зефир
            </h2>
            <p className='text-[20px] sm:text-[24px]'>
                Это то, что нельзя сравнить ни с чем. Это не приторная жесткая пастила из магазина и не супер воздушность классического зефира, при этом не очень сладкий (абсолютно не похож на магазинный зефир), невероятно красивый, реалистичный зефирный цветок. ВАУ-эффект! Заказ минимум за 5 дней, композиции могут быть собраны под любой бюджет.
            </p>
        </motion.section>
    )
}

export const MotionBlock1 = () => {

    const block1Ref = useRef<HTMLLIElement>(null);
    const block2Ref = useRef<HTMLLIElement>(null);
    const block3Ref = useRef<HTMLLIElement>(null);

    const [isBlock1Visible, setIsBlock1Visible] = useState(false);
    const [isBlock2Visible, setIsBlock2Visible] = useState(false);
    const [isBlock3Visible, setIsBlock3Visible] = useState(false);

    const checkVisibility = () => {
        if (block1Ref.current) {
            const rect1 = block1Ref.current.getBoundingClientRect();
            setIsBlock1Visible(rect1.top < window.innerHeight - 20);
        }
        if (block2Ref.current) {
            const rect2 = block2Ref.current.getBoundingClientRect();
            setIsBlock2Visible(rect2.top < window.innerHeight - 20);
        }
        if (block3Ref.current) {
            const rect3 = block3Ref.current.getBoundingClientRect();
            setIsBlock3Visible(rect3.top < window.innerHeight - 20);
        }
    };

    useEffect(() => {
        window.addEventListener('scroll', checkVisibility);
        checkVisibility(); // Проверяем видимость при первом рендере

        return () => {
            window.removeEventListener('scroll', checkVisibility);
        };
    }, []);

    return (
        <ul className='flex flex-col sm:flex-row justify-between text-[24px] items-center w-full gap-5 mt-10'>
            <motion.li
                ref={block1Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние (невидимый и сдвинут влево)
                animate={{ opacity: isBlock1Visible ? 1 : 0, x: isBlock1Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0 }} // Задержка для первого блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px] group'
            >
                <svg className='group-hover:fill-red-600 duration-300 w-[29px] h-[32px] items-start mb-4' viewBox="0 0 29 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M16.9875 17.3125L20.05 17.75C21.3 17.9375 21.8 19.4375 20.925 20.3125L18.675 22.4375L19.175 25.5C19.425 26.75 18.1125 27.6875 17.05 27.125L14.2375 25.6875L11.4875 27.125C10.425 27.6875 9.1125 26.75 9.3625 25.5L9.8625 22.4375L7.6125 20.3125C6.7375 19.4375 7.2375 17.9375 8.4875 17.75L11.55 17.3125L12.925 14.5C13.4875 13.375 15.05 13.375 15.6125 14.5L16.9875 17.3125ZM12.8625 19.125L9.7375 19.5625L11.9875 21.75L11.4875 24.875L14.2375 23.375L17.05 24.875L16.55 21.75L18.8 19.5625L15.675 19.125L14.2375 16.3125L12.8625 19.125ZM8.3 4H20.3V1C20.3 0.5 20.7375 0 21.3 0C21.8 0 22.3 0.5 22.3 1V4H24.3C26.4875 4 28.3 5.8125 28.3 8V28C28.3 30.25 26.4875 32 24.3 32H4.3C2.05 32 0.3 30.25 0.3 28V8C0.3 5.8125 2.05 4 4.3 4H6.3V1C6.3 0.5 6.7375 0 7.3 0C7.8 0 8.3 0.5 8.3 1V4ZM2.3 28C2.3 29.125 3.175 30 4.3 30H24.3C25.3625 30 26.3 29.125 26.3 28V12H2.3V28ZM2.3 8V10H26.3V8C26.3 6.9375 25.3625 6 24.3 6H4.3C3.175 6 2.3 6.9375 2.3 8Z" fill="#262626"></path>
                </svg>
                Более 10 <br />лет опыта
            </motion.li>
            <motion.li
                ref={block2Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние
                animate={{ opacity: isBlock2Visible ? 1 : 0, x: isBlock2Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0.2 }} // Задержка для второго блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px]'
            >
                <svg className='w-[32px] h-[32px] items-start mb-4' viewBox="0 0 40 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M19.9375 20C23.5625 20 26.4375 17.125 26.4375 13.5C26.4375 9.9375 23.5 7 19.9375 7C16.375 7 13.5 9.9375 13.5 13.5C13.4375 17.125 16.375 20 19.9375 20ZM19.9375 9C22.4375 9 24.4375 11.0625 24.4375 13.5C24.4375 16 22.4375 18 19.9375 18C17.5 18 15.4375 16 15.4375 13.5C15.4375 11.0625 17.5 9 19.9375 9ZM23.0625 22H16.875C11.9375 22 8 25.75 8 30.375C8 31.3125 8.75 32 9.75 32H30.1875C31.1875 32 32 31.3125 32 30.375C32 25.75 28 22 23.0625 22ZM10 30C10.1875 26.6875 13.1875 24 16.8125 24H23.0625C26.75 24 29.75 26.6875 29.9375 30H10ZM32 10C34.75 10 37 7.8125 37 5C37 2.25 34.75 0 32 0C29.1875 0 27 2.25 27 5C27 7.8125 29.1875 10 32 10ZM32 2C33.625 2 35 3.375 35 5C35 6.6875 33.625 8 32 8C30.3125 8 29 6.6875 29 5C29 3.375 30.3125 2 32 2ZM8 10C10.75 10 13 7.8125 13 5C13 2.25 10.75 0 8 0C5.1875 0 3 2.25 3 5C3 7.8125 5.1875 10 8 10ZM8 2C9.625 2 11 3.375 11 5C11 6.6875 9.625 8 8 8C6.3125 8 5 6.6875 5 5C5 3.375 6.3125 2 8 2ZM35.0625 12H31C30.25 12 29.5625 12.1875 28.9375 12.5C28.4375 12.75 28.25 13.3125 28.4375 13.8125C28.6875 14.3125 29.3125 14.5625 29.8125 14.3125C30.1875 14.125 30.5625 14 31 14H35.0625C36.625 14 38 15.4375 38 17.1875V18C38 18.5625 38.4375 19 39 19C39.5 19 40 18.5625 40 18V17.1875C40 14.375 37.75 12 35.0625 12ZM10.125 14.3125C10.625 14.5625 11.25 14.3125 11.5 13.8125C11.6875 13.3125 11.5 12.75 11 12.5C10.375 12.1875 9.6875 12 9 12H4.875C2.1875 12 0 14.375 0 17.1875V18C0 18.5625 0.4375 19 1 19C1.5 19 2 18.5625 2 18V17.1875C2 15.4375 3.3125 14 4.875 14H9C9.375 14 9.75 14.125 10.125 14.3125Z" fill="#262626"></path>
                </svg>
                Более 2.500 <br />клиентов
            </motion.li>
            <motion.li
                ref={block3Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние
                animate={{ opacity: isBlock3Visible ? 1 : 0, x: isBlock3Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0.4 }} // Задержка для третьего блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px]'
            >
                <svg className='w-[31px] h-[27px] items-start mb-4' viewBox="0 0 33 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M6.4 10H3.4C1.9625 10 0.9 11.125 0.9 12.5V25.5C0.9 26.9375 1.9625 28 3.4 28H6.4C7.775 28 8.9 26.9375 8.9 25.5V12.5C8.9 11.125 7.775 10 6.4 10ZM6.9 25.5C6.9 25.8125 6.65 26 6.4 26H3.4C3.0875 26 2.9 25.8125 2.9 25.5V12.5C2.9 12.25 3.0875 12 3.4 12H6.4C6.65 12 6.9 12.25 6.9 12.5V25.5ZM32.9 11.875C32.9 9.75 31.15 8 29.025 8H22.65C23.3375 6.3125 23.775 4.6875 23.775 3.8125C23.775 1.9375 22.3375 0 19.9 0C17.3375 0 16.775 1.875 16.2125 3.4375C14.525 8.75 10.9 9.5625 10.9 11C10.9 11.625 11.3375 12 11.9 12C12.15 12 12.4 11.9375 12.5875 11.75C15.8375 8.4375 16.775 8.25 18.15 4.0625C18.7125 2.3125 18.9 2 19.9 2C21.2125 2 21.775 3.0625 21.775 3.8125C21.775 4.4375 21.2125 6.5625 20.15 8.5625C20.025 8.6875 20.025 8.875 20.025 9C20.025 9.625 20.525 10 21.025 10H29.025C30.025 10 30.9 10.875 30.9 11.875C30.9 12.8125 30.0875 13.625 29.15 13.6875C28.65 13.75 28.2125 14.1875 28.2125 14.6875C28.2125 15.4375 28.9625 15.5 28.9625 16.625C28.9625 17.5 28.3375 18.25 27.4625 18.4375C27.0875 18.5 26.65 18.8125 26.65 19.375C26.65 19.9375 27.0875 20.0625 27.0875 20.875C27.0875 22.8125 25.0875 22.25 25.0875 23.5625C25.0875 23.8125 25.2125 23.875 25.2125 24.1875C25.2125 25.1875 24.3375 26 23.3375 26H19.8375C14.7125 26 13.0875 22 11.9 22C11.3375 22 10.9 22.5 10.9 23C10.8375 24.0625 14.9 28 19.8375 28H23.3375C25.4625 28 27.2125 26.3125 27.2125 24.1875C28.3375 23.5 29.0875 22.25 29.0875 20.875C29.0875 20.5625 29.025 20.25 28.9625 20C30.15 19.3125 30.9625 18.0625 30.9625 16.625C30.9625 16.1875 30.9 15.6875 30.7125 15.3125C32.025 14.6875 32.9 13.375 32.9 11.875Z" fill="#262626"></path>
                </svg>
                Строгое соблюдение <br />рецептуры
            </motion.li>
        </ul>
    )
}

export const MotionBlock2 = () => {

    const block1Ref = useRef<HTMLLIElement>(null);
    const block2Ref = useRef<HTMLLIElement>(null);
    const block3Ref = useRef<HTMLLIElement>(null);

    const [isBlock1Visible, setIsBlock1Visible] = useState(false);
    const [isBlock2Visible, setIsBlock2Visible] = useState(false);
    const [isBlock3Visible, setIsBlock3Visible] = useState(false);

    const checkVisibility = () => {
        if (block1Ref.current) {
            const rect1 = block1Ref.current.getBoundingClientRect();
            setIsBlock1Visible(rect1.top < window.innerHeight - 20);
        }
        if (block2Ref.current) {
            const rect2 = block2Ref.current.getBoundingClientRect();
            setIsBlock2Visible(rect2.top < window.innerHeight - 20);
        }
        if (block3Ref.current) {
            const rect3 = block3Ref.current.getBoundingClientRect();
            setIsBlock3Visible(rect3.top < window.innerHeight - 20);
        }
    };

    useEffect(() => {
        window.addEventListener('scroll', checkVisibility);
        checkVisibility(); // Проверяем видимость при первом рендере

        return () => {
            window.removeEventListener('scroll', checkVisibility);
        };
    }, []);

    return (
        <ul className='flex flex-col sm:flex-row justify-between text-[24px] items-center w-full gap-5 mt-10'>
            <motion.li
                ref={block1Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние (невидимый и сдвинут влево)
                animate={{ opacity: isBlock1Visible ? 1 : 0, x: isBlock1Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0 }} // Задержка для первого блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px]'
            >
                <svg className='w-[32px] h-[32px] items-start mb-4' viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M16 6.3125L18.375 2.4375C19.3125 0.9375 21 0 22.8125 0H23C25.75 0 28 2.25 28 5C28 6.1875 27.625 7.1875 27 8H29C30.625 8 32 9.375 32 11V15C32 16.3125 31.125 17.4375 30 17.875V28C30 30.25 28.1875 32 26 32H6C3.75 32 2 30.25 2 28V17.875C0.8125 17.4375 0 16.3125 0 15V11C0 9.375 1.3125 8 3 8H4.9375C4.3125 7.1875 4 6.1875 4 5C4 2.25 6.1875 0 9 0H9.125C10.9375 0 12.625 0.9375 13.5625 2.4375L16 6.3125ZM22.8125 2C21.6875 2 20.6875 2.625 20.0625 3.5L17.25 8H23C24.625 8 26 6.6875 26 5C26 3.375 24.625 2 23 2H22.8125ZM14.6875 8L11.875 3.5C11.25 2.625 10.25 2 9.125 2H9C7.3125 2 6 3.375 6 5C6 6.6875 7.3125 8 9 8H14.6875ZM3 10C2.4375 10 2 10.5 2 11V15C2 15.5625 2.4375 16 3 16H15V10H3ZM17 16H29C29.5 16 30 15.5625 30 15V11C30 10.5 29.5 10 29 10H17V16ZM15 18H4V28C4 29.125 4.875 30 6 30H15V18ZM17 30H26C27.0625 30 28 29.125 28 28V18H17V30Z" fill="#262626"></path>
                </svg>
                Необычный восхищающий <br />подарок
            </motion.li>
            <motion.li
                ref={block2Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние
                animate={{ opacity: isBlock2Visible ? 1 : 0, x: isBlock2Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0.2 }} // Задержка для второго блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px]'
            >
                <svg className='w-[32px] h-[32px] items-start mb-4' viewBox="0 0 33 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M30.875 0.625C30.8125 0.5 30.6875 0.375 30.625 0.3125C30.375 0.0625 30.0625 0 29.75 0.0625C29.5 0.125 29.1875 0.25 29.0625 0.5625C27.4375 3.375 24.5625 5.0625 21.1875 5.0625H16.875C11.125 5 6.5 9.75 6.5 15.625C6.5 15.9375 6.5 16.3125 6.5625 16.6875C3.5625 19.25 1.375 22.75 0.5 26.8125C0.375 27.375 0.75 27.875 1.25 27.9375C1.3125 28 1.375 28 1.5 28C1.9375 28 2.375 27.6875 2.4375 27.25C3.125 24 4.8125 21.125 7 18.9375C7.1875 19.4375 7.4375 20 7.6875 20.5C9.5625 23.9375 13.0625 26 16.875 26C17.25 26 17.625 26 17.9375 26C26.375 25.375 32.5 18 32.5 8.4375C32.5 5.75 31.875 2.9375 30.875 0.625ZM17.75 24C17.4375 24 17.125 24 16.8125 24C13.75 24 10.875 22.3125 9.4375 19.5625C9 18.875 8.75 18.125 8.625 17.5C11.5 15.3125 15 14 18.75 14H21.4375C21.9375 14 22.4375 13.5625 22.4375 13.0625C22.4375 12.5625 21.9375 12.0625 21.4375 12.0625H18.75C15 12.0625 11.4375 13.25 8.4375 15.1875C8.6875 10.75 12.4375 7.0625 16.875 7.0625H21.125C24.5 7.0625 27.5625 5.6875 29.625 3.1875C30.1875 4.8125 30.5 6.6875 30.5 8.4375C30.5 16.9375 25.125 23.4375 17.75 24Z" fill="#262626"></path>
                </svg>
                100% полезный и <br />натуральный продукт
            </motion.li>
            <motion.li
                ref={block3Ref}
                initial={{ opacity: 0, x: -50 }} // Начальное состояние
                animate={{ opacity: isBlock3Visible ? 1 : 0, x: isBlock3Visible ? 0 : -50 }} // Конечное состояние
                transition={{ duration: 0.5, delay: 0.4 }} // Задержка для третьего блока
                className='bg-white border-solid border-white border-2 rounded-2xl w-full p-[48px]'
            >
                <svg className='w-[28px] h-[32px] items-start mb-4' viewBox="0 0 30 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M11.5 16C11.5 14.125 13.0625 12.5 15 12.5C16.875 12.5 18.5 14.125 18.5 16C18.5 17.9375 16.875 19.5 15 19.5C13.0625 19.5 11.5 17.9375 11.5 16ZM15 14.5C14.125 14.5 13.5 15.1875 13.5 16C13.5 16.875 14.125 17.5 15 17.5C15.8125 17.5 16.5 16.875 16.5 16C16.5 15.1875 15.8125 14.5 15 14.5ZM13.6875 1.5625C14.4375 0.875 15.5625 0.875 16.25 1.5625C17 2.25 18.3125 3.5625 19.4375 5.25C20.5625 6.875 21.625 8.875 21.625 11.0625C21.625 11.625 21.5 12.1875 21.375 12.75C22.0625 12.875 22.6875 13.125 23.3125 13.5C25.1875 14.5625 26.4375 16.4375 27.3125 18.25C28.1875 20 28.6875 21.8125 28.9375 22.8125C29.125 23.8125 28.5625 24.75 27.625 25.0625C26.625 25.375 24.8125 25.8125 22.8125 26C20.8125 26.125 18.5625 26 16.6875 24.875C16 24.5 15.4375 24.0625 14.9375 23.5C14.5 24.0625 13.9375 24.5 13.25 24.875C11.375 26 9.125 26.125 7.125 26C5.125 25.8125 3.3125 25.375 2.3125 25.0625C1.375 24.75 0.8125 23.8125 1 22.8125C1.25 21.8125 1.75 20 2.625 18.25C3.5 16.4375 4.75 14.5625 6.625 13.5C7.25 13.125 7.875 12.875 8.5625 12.75C8.4375 12.1875 8.3125 11.625 8.3125 11.0625C8.3125 8.875 9.375 6.875 10.5 5.25C11.625 3.5625 12.9375 2.25 13.6875 1.5625ZM15 3.0625C14.25 3.75 13.125 4.9375 12.125 6.375C11.0625 7.875 10.3125 9.5 10.3125 11.0625C10.3125 11.8125 10.5 12.5 10.8125 13.125C11 13.4375 11 13.8125 10.8125 14.125C10.625 14.4375 10.3125 14.625 9.9375 14.625C9.1875 14.5625 8.375 14.8125 7.625 15.1875C6.25 16 5.1875 17.4375 4.4375 19.0625C3.6875 20.625 3.25 22.25 3 23.1875C3.9375 23.4375 5.5625 23.875 7.25 24C9.125 24.125 10.9375 23.9375 12.25 23.1875C13.0625 22.6875 13.6875 22.0625 14.0625 21.3125C14.25 20.9375 14.5625 20.75 14.9375 20.75C15.3125 20.75 15.6875 20.9375 15.875 21.3125C16.25 22.0625 16.875 22.6875 17.6875 23.1875C19 23.9375 20.8125 24.125 22.625 24C24.375 23.875 26 23.4375 26.9375 23.1875C26.6875 22.25 26.25 20.625 25.5 19.0625C24.6875 17.4375 23.625 16 22.3125 15.1875C21.5625 14.8125 20.75 14.625 20 14.5625C19.625 14.5625 19.3125 14.4375 19.125 14.125C18.9375 13.8125 18.9375 13.4375 19.125 13.125C19.4375 12.5 19.625 11.8125 19.625 11.0625C19.625 9.5 18.875 7.875 17.8125 6.375C16.8125 4.9375 15.6875 3.75 15 3.0625ZM16.125 32.125C15.5625 32.9375 14.375 32.9375 13.8125 32.125C13.25 31.3125 12.375 29.75 11.875 27.5C12.5 27.3125 13.125 27 13.75 26.6875C14.0625 28.1875 14.5625 29.375 15 30.1875C15.375 29.375 15.875 28.1875 16.1875 26.6875C16.8125 27 17.4375 27.3125 18.0625 27.5C17.5625 29.75 16.6875 31.3125 16.125 32.125ZM1.5625 7.625C2.5 7.5 4.375 7.4375 6.75 8.25C6.625 8.875 6.5 9.5625 6.5 10.25C4.875 9.6875 3.5625 9.5625 2.6875 9.5625C3.125 10.25 3.75 11.1875 4.875 12.1875C4.3125 12.5625 3.8125 13 3.3125 13.5C1.625 11.875 0.8125 10.375 0.4375 9.5625C0.125 8.6875 0.625 7.75 1.5625 7.625ZM27.25 9.5625C26.375 9.5625 25.0625 9.6875 23.4375 10.25C23.4375 9.5625 23.3125 8.875 23.1875 8.25C25.5625 7.4375 27.4375 7.5 28.375 7.625C29.3125 7.75 29.8125 8.6875 29.5 9.5625C29.125 10.375 28.3125 11.875 26.625 13.5C26.125 13 25.625 12.5625 25.0625 12.1875C26.1875 11.1875 26.8125 10.25 27.25 9.5625Z" fill="#262626"></path>
                </svg>
                Букеты, которые <br />не завянут
            </motion.li>
        </ul>
    )
}